PKS1C/src/Reports/ГрафикРаботРаботника/ГрафикРаботРаботника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ГрафикРаботРаботника</name>
</mdclass:Report>

PKS1C/src/InformationRegisters/НормаРабот/НормаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормаРабот</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СуточнаяНорма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МесячнаяНорма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Работник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/InformationRegisters/ПочасовыеРаботы/ПочасовыеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочасовыеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Удаленка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сверхурочка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставРабот</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкиКлиентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Reports/ГрафикРаботРаботника/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура МесяцНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Месяц = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2"); 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформирватьНаСервере(Работник, Месяц, Диаграмма)
	ЗапросНорм = Новый Запрос;
	ЗапросНорм.Текст = 
		"ВЫБРАТЬ
		|	НормаРабот.СуточнаяНорма КАК СуточнаяНорма,
		|	НормаРабот.Работник КАК Работник,
		|	ПРЕДСТАВЛЕНИЕ(НормаРабот.Работник) КАК РаботникПредставление,
		|	НормаРабот.МесячнаяНорма КАК МесячнаяНорма
		|ИЗ
		|	РегистрСведений.НормаРабот КАК НормаРабот
		|ГДЕ
		|	НормаРабот.Работник = &Работник
		|	И НормаРабот.Регистратор.Дата <= &Дата";
	
	ЗапросНорм.УстановитьПараметр("Работник", Работник);	
	ЗапросНорм.УстановитьПараметр("Дата", КонецДня(Месяц));
	РезультатЗапросаНорм = ЗапросНорм.Выполнить();	
	ВыборкаНорм = РезультатЗапросаНорм.Выбрать();
	ВыборкаНорм.Следующий();
	
	ЗапросРабот = Новый Запрос;
	ЗапросРабот.Текст = 
		"ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(ПочасовыеРаботы.Регистратор.Дата, ДЕНЬ) КАК Дата,
		|	ПочасовыеРаботы.Исполнитель КАК Исполнитель,
		|	ПРЕДСТАВЛЕНИЕ(ПочасовыеРаботы.Исполнитель) КАК ИсполнительПредставление,
		|	ПочасовыеРаботы.ВремяЗатраты КАК ВремяЗатраты,
		|	ПочасовыеРаботы.Сверхурочка КАК Сверхурочка
		|ИЗ
		|	РегистрСведений.ПочасовыеРаботы КАК ПочасовыеРаботы
		|ГДЕ
		|	ПочасовыеРаботы.Регистратор.Дата МЕЖДУ &От И &До
		|	И ПочасовыеРаботы.Исполнитель = &Исполнитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ
		|	СУММА(ВремяЗатраты)
		|ПО
		|	Исполнитель,
		|	Дата,
		|	Сверхурочка";
	
	От = КонецДня(Месяц);
	До = КонецМесяца(Месяц);
	
	ЗапросРабот.УстановитьПараметр("До", КонецМесяца(Месяц));
	ЗапросРабот.УстановитьПараметр("От", Месяц);
	ЗапросРабот.УстановитьПараметр("Исполнитель", Работник);
	
	РезультатЗапросаРабот = ЗапросРабот.Выполнить();
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.АвтоТранспонирование = Ложь;
	
	ВыборкаИсполнитель = РезультатЗапросаРабот.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИсполнитель.Следующий();
	
	Дата = От;
			
	Серия = Диаграмма.УстановитьСерию("Обычные работы");
	Серия.Текст = "Обычные работы";
	Серия.Расшифровка = ВыборкаИсполнитель.Исполнитель;
	
	СерияСверхурочка = Диаграмма.УстановитьСерию("Сверхурочные работы");
	СерияСверхурочка.Текст = "Сверхурочные работы";
	СерияСверхурочка.Расшифровка = ВыборкаИсполнитель.Исполнитель;
	
	СерияИндикатор =  Диаграмма.УстановитьСерию("СуточнаяНорма");
	СерияИндикатор.Индикатор = Истина;
	СерияИндикатор.Линия = Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	СерияИндикатор.Маркер = ТипМаркераДиаграммы.Нет;
	
	ВыборкаДата = ВыборкаИсполнитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДата.Следующий();
	
	СуммаВремязатрат = 0;
	
	Пока Дата <= До Цикл			
		Если Не Дата = ВыборкаДата.Дата Тогда
			Точка = Диаграмма.УстановитьТочку(Формат(Дата, "ДФ=""дд.ММ.гггг"""));
			Точка.Текст = Формат(Дата, "ДФ=""дд.ММ.гггг""");
			Точка.Расшифровка = Формат(Дата, "ДФ=""дд.ММ.гггг""");
			Диаграмма.УстановитьЗначение(Точка, Серия, 0);
		ИначеЕсли Дата = ВыборкаДата.Дата Тогда
			ВыборкаСверхурочка = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСверхурочка.Следующий() Цикл
				Если ВыборкаСверхурочка.Сверхурочка Тогда
					Точка = Диаграмма.УстановитьТочку(Формат(Дата, "ДФ=""дд.ММ.гггг"""));
					Точка.Текст = Формат(Дата, "ДФ=""дд.ММ.гггг""");
					Точка.Расшифровка = Формат(Дата, "ДФ=""дд.ММ.гггг""");
					Диаграмма.УстановитьЗначение(Точка, СерияСверхурочка, ВыборкаСверхурочка.ВремяЗатраты);
				Иначе
					Точка = Диаграмма.УстановитьТочку(Формат(Дата, "ДФ=""дд.ММ.гггг"""));
					Точка.Текст = Формат(Дата, "ДФ=""дд.ММ.гггг""");
					Точка.Расшифровка = Формат(Дата, "ДФ=""дд.ММ.гггг""");
					Диаграмма.УстановитьЗначение(Точка, Серия, ВыборкаСверхурочка.ВремяЗатраты);
					СуммаВремязатрат = СуммаВремязатрат + ВыборкаСверхурочка.ВремяЗатраты;
				КонецЕсли;
			КонецЦикла;
			ВыборкаДата.Следующий();
		КонецЕсли;
		Диаграмма.УстановитьЗначение(Точка, СерияИндикатор, ВыборкаНорм.СуточнаяНорма);
		Дата = Дата + 86400;
	КонецЦикла;
	
	СерияМесячняНорма =  Диаграмма.УстановитьСерию("Месячная норма: " + Строка(СуммаВремязатрат) + "/" + Строка(ВыборкаНорм.МесячнаяНорма));
	СерияМесячняНорма.ОтображатьГрафическоеПредставлениеДанныхВДиаграмме = ОтображениеВДиаграмме.НеОтображать;
	СерияМесячняНорма.ОтображатьГрафическоеПредставлениеДанныхВЛегендеДиаграммы  = ОтображениеВЛегендеДиаграммы.Отображать;
	
	Диаграмма.АвтоТранспонирование = Истина;
	Диаграмма.Обновление = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформирвать(Команда)
	СформирватьНаСервере(ЭтаФорма.Работник, ЭтаФорма.Месяц, ЭтаФорма.График);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = НачалоМесяца(ТекущаяДата());
	Работник = ПолучитьИсполнителя();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИсполнителя(Пользователь=Неопределено)
	Если Пользователь = Неопределено Тогда
		Возврат ПользователиКлиентСервер.ТекущийПользователь().ФизическоеЛицо;
	Иначе
		Возврат ПользователиКлиентСервер.Пользователь.ФизическоеЛицо;
	КонецЕсли;
КонецФункции
